//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:	ATACTRL.UNI
//
// Description:	ATA Controller setup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#string STR_SATA_PCI_SWITCH_FORM              #language eng "HYGON 35N16 SATA PCIe Switch"
#string STR_SATA_PCI_SWITCH_HELP              #language eng "This Option Is Used For Configuring CPU DXIO to SATA or PCIe Interface"

#string STR_SATA_PCI_SWITCH_CONF_FORM         #language eng "Sata PCIe Switch Configuration"
#string STR_CPU_SOCKET0_DIE0                  #language eng "Socket0 Die0 Option"
#string STR_CPU_SOCKET0_DIE1                  #language eng "Socket0 Die1 Option"
#string STR_CPU_SOCKET0_DIE2                  #language eng "Socket0 Die2 Option"
#string STR_CPU_SOCKET0_DIE3                  #language eng "Socket0 Die3 Option"

#string STR_CPU_SOCKET0_PORT0                 #language eng "S0 G3[0:3] MSAS J12"
#string STR_CPU_SOCKET0_PORT0_HELP            #language eng "S0 G3[0:3] MSAS J12(Support HP)"
#string STR_CPU_SOCKET0_PORT1                 #language eng "S0 G3[4:7] MSAS J13"
#string STR_CPU_SOCKET0_PORT1_HELP            #language eng "S0 G3[4:7] MSAS J13(Support HP)"
#string STR_CPU_SOCKET0_PORT2                 #language eng "S0 G2[0:3] MSAS J16"
#string STR_CPU_SOCKET0_PORT2_HELP            #language eng "S0 G2[0:3] MSAS J16"
#string STR_CPU_SOCKET0_PORT3                 #language eng "S0 G2[4:7] MSAS J17"
#string STR_CPU_SOCKET0_PORT3_HELP            #language eng "S0 G2[4:7] MSAS J17"
#string STR_CPU_SOCKET0_PORT4                 #language eng "S0 P1[0:3] MSAS J18"
#string STR_CPU_SOCKET0_PORT4_HELP            #language eng "S0 P1[0:3] MSAS J18(Support HP)"
#string STR_CPU_SOCKET0_PORT5                 #language eng "S0 P1[4:7] MSAS J19"
#string STR_CPU_SOCKET0_PORT5_HELP            #language eng "S0 P1[4:7] MSAS J19(Support HP)"
#string STR_CPU_SOCKET0_PORT6                 #language eng "S0 P0[4:7] J110005"
#string STR_CPU_SOCKET0_PORT6_HELP            #language eng "S0 P0[4:7] J110005"

#string STR_PCIE_INTERFACE_TEXT               #language eng "PCIe Interface"
#string STR_SATA_INTERFACE_TEXT               #language eng "SATA Interface"

#string STR_CPU_SOCKET0_PCIE_SLOT0            #language eng "S0 G1[0:15] PCIE J24"
#string STR_CPU_SOCKET0_PCIE_SLOT0_HELP       #language eng "S0 G1[0:15] PCIE J24"
#string STR_CPU_SOCKET0_PCIE_SLOT1            #language eng "S0 P2[0:15] PCIE J25"
#string STR_CPU_SOCKET0_PCIE_SLOT1_HELP       #language eng "S0 P2[0:15] PCIE J25(Support HP)"
#string STR_CPU_SOCKET0_PCIE_SLOT2            #language eng "S0 P3[0:15] PCIE J26"
#string STR_CPU_SOCKET0_PCIE_SLOT2_HELP       #language eng "S0 P3[0:15] PCIE J26"
#string STR_CPU_SOCKET0_PCIE_SLOT3            #language eng "S0 G3[8:15] PCIE J27"
#string STR_CPU_SOCKET0_PCIE_SLOT3_HELP       #language eng "S0 G3[8:15] PCIE J27"
#string STR_CPU_SOCKET0_PCIE_SLOT4            #language eng "S0 G0[0:15] PCIE J28"
#string STR_CPU_SOCKET0_PCIE_SLOT4_HELP       #language eng "S0 G0[0:15] PCIE J28"
#string STR_CPU_SOCKET0_MEZZ_SLOT5            #language eng "S0 P1[8:15] MEZZ J30_1"
#string STR_CPU_SOCKET0_MEZZ_SLOT5_HELP       #language eng "S0 P1[8:15] MEZZ J30_1"

#string STR_PCIE_X16_TEXT                     #language eng "X16"
#string STR_PCIE_X8X8_TEXT                    #language eng "X8_X8"
#string STR_PCIE_X4X4X4X4_TEXT                #language eng "X4_X4_X4_X4"
#string STR_PCIE_X8X4X4_TEXT                  #language eng "X8_X4_X4"
#string STR_PCIE_X4X4X8_TEXT                  #language eng "X4_X4_X8"

#string STR_PCIE_X8_TEXT                      #language eng "X8"
#string STR_PCIE_X4X4_TEXT                    #language eng "X4_X4"

#string STR_PCIE_X4_TEXT                      #language eng "X4"
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************